
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

s = [2, 3, 5, 6]
x = [ ]
k = -1
if len(s)%2==0:
    l = len (s)//2
else:
    l = (len (s)//2)+1
for i in range (0, l):
    x.append (s[i]*s[k])
    k = k-1
print (x)